In [85]:
import pandas as pd

In [86]:
uriage = pd.read_csv("../csv/uriage.csv")
uriage.head()

      purchase_date item_name  item_price customer_name
0  2019-06-13 18:02       상품A       100.0           김가온
1  2019-07-13 13:05     상 품 S         NaN           김우찬
2  2019-05-11 19:42     상 품 a         NaN           김유찬
3  2019-02-12 23:40       상품Z      2600.0           김재현
4   2019-04-22 3:09       상품a         NaN           김강현

In [87]:
uriage.isna().sum()

purchase_date      0
item_name          0
item_price       387
customer_name      0
dtype: int64

In [88]:
# 시계열 데이터로 데이터의 형태를 변경
# pd.to_datetime(변경할 데이터, format = "")
t = '04/05/05'
pd.to_datetime(t, format="%y/%m/%d")

Timestamp('2004-05-05 00:00:00')

In [89]:
# purchase_date 컬럼을 시계열로 변경
uriage['purchase_date']
uriage['purchase_date'] = pd.to_datetime(uriage['purchase_date'], 
                format = '%Y-%m-%d %H:%M')

In [90]:
# 원본데이터를 생성
origin_data = uriage.copy()

In [91]:
origin_data

           purchase_date item_name  item_price customer_name
0    2019-06-13 18:02:00       상품A       100.0           김가온
1    2019-07-13 13:05:00     상 품 S         NaN           김우찬
2    2019-05-11 19:42:00     상 품 a         NaN           김유찬
3    2019-02-12 23:40:00       상품Z      2600.0           김재현
4    2019-04-22 03:09:00       상품a         NaN           김강현
...                  ...       ...         ...           ...
2994 2019-02-15 02:56:00       상품Y      2500.0           김정민
2995 2019-06-22 04:03:00       상품M      1300.0           김재원
2996 2019-03-29 11:14:00       상품Q         NaN           김지율
2997 2019-07-14 12:56:00       상품H         NaN           김승주
2998 2019-07-21 00:31:00       상품D       400.0           정준기

[2999 rows x 4 columns]

In [92]:
uriage.drop("item_name", axis=1, inplace=True)
uriage.head(1)

        purchase_date  item_price customer_name
0 2019-06-13 18:02:00       100.0           김가온

In [93]:

uriage = origin_data.copy()

In [94]:
uriage.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2999 entries, 0 to 2998
Data columns (total 4 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   purchase_date  2999 non-null   datetime64[ns]
 1   item_name      2999 non-null   object
 2   item_price     2612 non-null   float64
 3   customer_name  2999 non-null   object
dtypes: datetime64[ns](1), float64(1), object(2)
memory usage: 93.8+ KB

In [95]:
#item_name 컬럼의 데이터를 모두 대문자로 변경
# upper(): 문자열을 모두 대문자로 변환
# str.upper() 사용하여 문자열을 대문자로 변경하는 방식  
uriage['item_name'] = uriage['item_name'].str.upper()

In [96]:
# apply()함수를 이용하여 글자를 모두 소문자로 변경
# apply()는 스리즈 형태 데이타.apply(함수) ---> 스리즈의 데이터들을 하나씩 함수안에 넣어서 결과값으로 새로운 스리즈형태의 데이터를 생성

def change(x):
    result = x.lower()
    return result

uriage['item_name'] = uriage['item_name'].apply(change)

In [97]:
# apply(lambda함수)

uriage['item_name'] = uriage['item_name'].apply(lambda x : x.upper())

In [98]:
def change(x):
    print(x)
    return x

uriage.apply(change)

0      2019-06-13 18:02:00
1      2019-07-13 13:05:00
2      2019-05-11 19:42:00
3      2019-02-12 23:40:00
4      2019-04-22 03:09:00
               ...
2994   2019-02-15 02:56:00
2995   2019-06-22 04:03:00
2996   2019-03-29 11:14:00
2997   2019-07-14 12:56:00
2998   2019-07-21 00:31:00
Name: purchase_date, Length: 2999, dtype: datetime64[ns]
0         상품A
1       상 품 S
2       상 품 A
3         상품Z
4         상품A
        ...
2994      상품Y
2995      상품M
2996      상품Q
2997      상품H
2998      상품D
Name: item_name, Length: 2999, dtype: object
0        100.0
1          NaN
2          NaN
3       2600.0
4          NaN
         ...
2994    2500.0
2995    1300.0
2996       NaN
2997       NaN
2998     400.0
Name: item_price, Length: 2999, dtype: float64
0       김가온
1       김우찬
2       김유찬
3       김재현
4       김강현
       ...
2994    김정민
2995    김재원
2996    김지율
2997    김승주
2998    정준기
Name: customer_name, Length: 2999, dtype: object

           purchase_date item_name  item_price customer_name
0    2019-06-13 18:02:00       상품A       100.0           김가온
1    2019-07-13 13:05:00     상 품 S         NaN           김우찬
2    2019-05-11 19:42:00     상 품 A         NaN           김유찬
3    2019-02-12 23:40:00       상품Z      2600.0           김재현
4    2019-04-22 03:09:00       상품A         NaN           김강현
...                  ...       ...         ...           ...
2994 2019-02-15 02:56:00       상품Y      2500.0           김정민
2995 2019-06-22 04:03:00       상품M      1300.0           김재원
2996 2019-03-29 11:14:00       상품Q         NaN           김지율
2997 2019-07-14 12:56:00       상품H         NaN           김승주
2998 2019-07-21 00:31:00       상품D       400.0           정준기

[2999 rows x 4 columns]

In [99]:
# item_name에 있는 공백을 제거 한다.
# 공백을 제거하는 함수는 strip() -> 문자열의 좌우 공백을 제거 -> 현재 데이터에서는 strip()은 사용불가 ex상 품 s이 있기 때문
# 문자열 사이의 공백까지 제거하려면 사용할 함수의 이름은? 
# replace(기준문자열, 대체할 문자열)
# replace(" ", "")

uriage['item_name'] =  uriage["item_name"].str.replace(" ","")

#def change(x):
#    result = x.replace(" ","")
#    return result
#uriage['item_name'].apply(change)


#uriage['item_name'].apply(lambda x : x.replace(" ","").lower())

# 3개다 같은 결과값을 주는 코드

In [100]:
# item_name을 기준으로 오름차순 정렬
uriage.sort_values("item_name")

           purchase_date item_name  item_price customer_name
0    2019-06-13 18:02:00       상품A       100.0           김가온
1748 2019-05-19 20:22:00       상품A       100.0           김시훈
223  2019-06-25 08:13:00       상품A       100.0           김유진
1742 2019-06-13 16:03:00       상품A       100.0           김건희
1738 2019-02-10 00:28:00       상품A       100.0           김하랑
...                  ...       ...         ...           ...
2880 2019-04-22 00:36:00       상품Y         NaN           김동욱
2881 2019-04-30 14:21:00       상품Y         NaN           김하준
1525 2019-01-24 10:27:00       상품Y      2500.0           김범준
1361 2019-05-28 13:45:00       상품Y      2500.0           김수현
3    2019-02-12 23:40:00       상품Z      2600.0           김재현

[2999 rows x 4 columns]

In [101]:
# 인덱스를 초기화 -> 기존의 인덱스는 삭제
uriage.reset_index(drop=True, inplace= True)

In [102]:
uriage['item_price'].isna().value_counts()

False    2612
True      387
Name: item_price, dtype: int64

1. 상품A의 item_price의 값은 결측치 중 상품이 A이면 이 값을 치환
2. 나머지 상품들도 같은 작업을 반복

In [103]:
# 상품A의 item_price를 출력
# 행의 조건? 결측치가 아니다, item_name이 상품A이다, 
# 열의 조건? item_price

# 결측치가 아닌 조건 1
flg_null = uriage['item_price'].isna()
    # or
#uriage.isna().any(1) item_price에만 결측치만 있는걸 알고 있이 때문에 할 수 있음

In [104]:
# 결측치인 값들을 출력
uriage.loc[flg_null]

           purchase_date item_name  item_price customer_name
1    2019-07-13 13:05:00       상품S         NaN           김우찬
2    2019-05-11 19:42:00       상품A         NaN           김유찬
4    2019-04-22 03:09:00       상품A         NaN           김강현
6    2019-05-18 19:16:00       상품A         NaN           김재준
14   2019-06-11 12:57:00       상품A         NaN           김재호
...                  ...       ...         ...           ...
2987 2019-01-04 13:05:00       상품K         NaN           김정훈
2990 2019-07-16 11:34:00       상품O         NaN           김서준
2992 2019-07-27 10:13:00       상품C         NaN           김동하
2996 2019-03-29 11:14:00       상품Q         NaN           김지율
2997 2019-07-14 12:56:00       상품H         NaN           김승주

[387 rows x 4 columns]

In [105]:
# item_name이 상품A인 경우만 출력하려면 
uriage.loc[uriage['item_name'] =='상품A']

           purchase_date item_name  item_price customer_name
0    2019-06-13 18:02:00       상품A       100.0           김가온
2    2019-05-11 19:42:00       상품A         NaN           김유찬
4    2019-04-22 03:09:00       상품A         NaN           김강현
6    2019-05-18 19:16:00       상품A         NaN           김재준
9    2019-01-28 10:47:00       상품A       100.0           김태윤
...                  ...       ...         ...           ...
2875 2019-06-03 17:33:00       상품A       100.0           김서진
2886 2019-04-25 17:15:00       상품A       100.0           김강현
2897 2019-05-20 14:05:00       상품A       100.0           김지안
2951 2019-05-06 02:24:00       상품A       100.0           김주혁
2973 2019-07-13 21:38:00       상품A       100.0           김태윤

[139 rows x 4 columns]

In [106]:
# 상품이A이고 item_price가 결측치인 경우
uriage.loc[(flg_null) & (uriage['item_name'] == '상품A')]

           purchase_date item_name  item_price customer_name
2    2019-05-11 19:42:00       상품A         NaN           김유찬
4    2019-04-22 03:09:00       상품A         NaN           김강현
6    2019-05-18 19:16:00       상품A         NaN           김재준
14   2019-06-11 12:57:00       상품A         NaN           김재호
300  2019-04-06 11:06:00       상품A         NaN           김태인
361  2019-01-21 03:33:00       상품A         NaN           김진우
667  2019-03-16 17:23:00       상품A         NaN           김주원
838  2019-06-24 05:06:00       상품A         NaN           김시호
844  2019-03-15 09:14:00       상품A         NaN           김강현
957  2019-07-19 14:12:00       상품A         NaN           김서윤
1260 2019-01-15 22:59:00       상품A         NaN           김하진
1394 2019-07-07 21:49:00       상품A         NaN           김은우
1474 2019-04-11 02:22:00       상품A         NaN           김선우
1892 2019-07-31 01:32:00       상품A         NaN           김윤찬
1937 2019-02-13 07:28:00       상품A         NaN           김시환
1977 2019-02-28 04:11:00       상품A         NaN           김서준
2063 2019-05-25 12:51:00       상품A         NaN           김재민
2278 2019-07-14 03:39:00       상품A         NaN           김시우
2636 2019-03-09 14:20:00       상품A         NaN           김우찬
2669 2019-03-05 20:21:00       상품A         NaN           김주혁
2732 2019-01-28 22:13:00       상품A         NaN           김윤호
2821 2019-06-21 11:09:00       상품A         NaN           김승훈

In [107]:
# 상품A이고 item_price가 결측치가 아닌경우
price = uriage.loc[(uriage['item_name'] == '상품A') & ~(flg_null), 'item_price'].value_counts().index[0]

In [108]:
# 결측치에 값을 치환하는 함수 
# fillna(n) : n의 값으로 결측치를 채운다

# uriage.loc[(flg_null) & (uriage['item_name'] == '상품A')].fillna(price) 결측치를 채우고자 할때
    # or
uriage.loc[(flg_null) & (uriage['item_name'] == '상품A'), 'item_price']= price 
# 위의 식을 price 값으로 채우겠다

In [112]:
# item_name의 리스트를 출력하려면 
name_list = uriage['item_name'].unique()

In [115]:
for i in name_list:
    # item_price의 값을 구한다.
    # item_name이 i 와 같고 결측치가 아닌 데이터에서 price를 출력
    price = uriage.loc[~(flg_null) & (uriage['item_name'] == i), 'item_price'].value_counts().index[0]
    # item_name이 i와 같고 결측치인 데이터에서 item_price에 price라는 변수를 삽입
    uriage.loc[(flg_null) & (uriage['item_name'] == i), 'item_price']= price

In [117]:
uriage.head()

        purchase_date item_name  item_price customer_name
0 2019-06-13 18:02:00       상품A       100.0           김가온
1 2019-07-13 13:05:00       상품S      1900.0           김우찬
2 2019-05-11 19:42:00       상품A       100.0           김유찬
3 2019-02-12 23:40:00       상품Z      2600.0           김재현
4 2019-04-22 03:09:00       상품A       100.0           김강현

In [118]:
uriage.tail()

           purchase_date item_name  item_price customer_name
2994 2019-02-15 02:56:00       상품Y      2500.0           김정민
2995 2019-06-22 04:03:00       상품M      1300.0           김재원
2996 2019-03-29 11:14:00       상품Q      1700.0           김지율
2997 2019-07-14 12:56:00       상품H       800.0           김승주
2998 2019-07-21 00:31:00       상품D       400.0           정준기